In [4]:
import pandas as pd

In [27]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 2', 'Store 3'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [28]:
df['Cost']

Store 1    22.5
Store 2     2.5
Store 3     5.0
Name: Cost, dtype: float64

In [29]:
df.loc[:, ['Cost']]

         Cost
Store 1  22.5
Store 2   2.5
Store 3   5.0

In [30]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [33]:
df_copy = df.copy()
df_copy = df_copy.drop('Store 2')
df_copy

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 3  Vinod      Bird Seed   5.0

In [38]:
df[df['Cost'] > 20]

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5